#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖``

<details><summary>Show Plan</summary>

```

terraform
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/flcdrg/terraform-azure-sql-auditing/runs/run-xzKXXhpozLesC1Tq

Waiting for the plan to start...

Terraform v1.10.5
on linux_amd64
Initializing plugins and modules...
random_string.storage_suffix: Refreshing state... [id=q2r]
random_password.password: Refreshing state... [id=none]
data.azurerm_client_config.current: Refreshing...
data.azurerm_resource_group.rg: Refreshing...
azurerm_log_analytics_solution.example: Refreshing state... [id=/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-terraform-sql-auditing-australiaeast/providers/Microsoft.OperationsManagement/solutions/SQLAuditing(log-terraform-sql-auditing-australiaeast)]
data.azurerm_client_config.current: Refresh complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD01MjUwMzk4Zi00YjFjLTQzZTktOTgyMy04ZDRlNTk4MGEyMDE7b2JqZWN0SWQ9ZGU0NDc1ZGUtODhiMS00YTc0LWFmNGUtZjA2MjM3MGM5MzY3O3N1YnNjcmlwdGlvbklkPWI0YjJlN2U5LTY2ZTctNDZiNS1hNTZiLWNjZTJiNTAwMTFkNDt0ZW5hbnRJZD01OWIwOTM0ZC00ZjM1LTRiZmYtYTJiNy1hNDUxZmU1ZjhiZDY=]
data.azurerm_resource_group.rg: Refresh complete after 1s [id=/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-terraform-sql-auditing-australiaeast]
azurerm_log_analytics_workspace.la: Refreshing state... [id=/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-terraform-sql-auditing-australiaeast/providers/Microsoft.OperationalInsights/workspaces/log-terraform-sql-auditing-australiaeast]
azurerm_eventhub_namespace.eh: Refreshing state... [id=/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-terraform-sql-auditing-australiaeast/providers/Microsoft.EventHub/namespaces/evhns-terraform-sql-auditing-australiaeast]
azurerm_mssql_server.mssql: Refreshing state... [id=/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-terraform-sql-auditing-australiaeast/providers/Microsoft.Sql/servers/sql-terraform-sql-auditing-australiaeast]
azurerm_storage_account.storage: Refreshing state... [id=/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-terraform-sql-auditing-australiaeast/providers/Microsoft.Storage/storageAccounts/sttfsqlauditaueq2r]
azurerm_mssql_firewall_rule.azure_services: Refreshing state... [id=/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-terraform-sql-auditing-australiaeast/providers/Microsoft.Sql/servers/sql-terraform-sql-auditing-australiaeast/firewallRules/AllowAzure]
azurerm_mssql_database.primary: Refreshing state... [id=/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-terraform-sql-auditing-australiaeast/providers/Microsoft.Sql/servers/sql-terraform-sql-auditing-australiaeast/databases/sqldb-terraform-sql-auditing-australiaeast]
azurerm_eventhub_namespace_authorization_rule.eh: Refreshing state... [id=/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-terraform-sql-auditing-australiaeast/providers/Microsoft.EventHub/namespaces/evhns-terraform-sql-auditing-australiaeast/authorizationRules/evhar-terraform-sql-auditing-australiaeast]
azurerm_eventhub.eh: Refreshing state... [id=/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-terraform-sql-auditing-australiaeast/providers/Microsoft.EventHub/namespaces/evhns-terraform-sql-auditing-australiaeast/eventhubs/evh-terraform-sql-auditing-australiaeast]
azurerm_role_assignment.mssql_has_storage_blob_data_contributor: Refreshing state... [id=/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-terraform-sql-auditing-australiaeast/providers/Microsoft.Storage/storageAccounts/sttfsqlauditaueq2r/providers/Microsoft.Authorization/roleAssignments/09e49f84-7c57-9ec1-dc6a-371a17ef2403]
azurerm_mssql_server_extended_auditing_policy.auditing: Refreshing state... [id=/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-terraform-sql-auditing-australiaeast/providers/Microsoft.Sql/servers/sql-terraform-sql-auditing-australiaeast/extendedAuditingSettings/default]
azurerm_monitor_diagnostic_setting.mssql_server: Refreshing state... [id=/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-terraform-sql-auditing-australiaeast/providers/Microsoft.Sql/servers/sql-terraform-sql-auditing-australiaeast/databases/master|diagnostic_setting]
azurerm_log_analytics_solution.example: Drift detected (delete)
azurerm_mssql_server_extended_auditing_policy.auditing: Drift detected (update)
azurerm_monitor_diagnostic_setting.mssql_server: Drift detected (delete)
azurerm_storage_account.storage: Drift detected (update)
azurerm_eventhub_namespace.eh: Drift detected (update)
azurerm_mssql_server.mssql: Drift detected (update)
azurerm_mssql_database.primary: Drift detected (update)
azurerm_log_analytics_workspace.la: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azapi_resource.symbolicname will be created
  + resource "azapi_resource" "symbolicname" {
      + body                      = {
          + plan       = {
              + name          = "SQLAuditing[log-terraform-sql-auditing-australiaeast]"
              + product       = "SQLAuditing"
              + promotionCode = ""
              + publisher     = "Microsoft"
            }
          + properties = {
              + containedResources  = [
                  + "/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-terraform-sql-auditing-australiaeast/providers/Microsoft.OperationalInsights/workspaces/log-terraform-sql-auditing-australiaeast/views/SQLSecurityInsights",
                  + "/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-terraform-sql-auditing-australiaeast/providers/Microsoft.OperationalInsights/workspaces/log-terraform-sql-auditing-australiaeast/views/SQLAccessToSensitiveData",
                ]
              + referencedResources = []
              + workspaceResourceId = "/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-terraform-sql-auditing-australiaeast/providers/Microsoft.OperationalInsights/workspaces/log-terraform-sql-auditing-australiaeast"
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = "australiaeast"
      + name                      = "SQLAuditing[log-terraform-sql-auditing-australiaeast]"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-terraform-sql-auditing-australiaeast"
      + schema_validation_enabled = true
      + tags                      = {}
      + type                      = "Microsoft.OperationsManagement/solutions@2015-11-01-preview"
    }

  # azurerm_monitor_diagnostic_setting.mssql_server will be created
  + resource "azurerm_monitor_diagnostic_setting" "mssql_server" {
      + eventhub_authorization_rule_id = "/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-terraform-sql-auditing-australiaeast/providers/Microsoft.EventHub/namespaces/evhns-terraform-sql-auditing-australiaeast/authorizationRules/evhar-terraform-sql-auditing-australiaeast"
      + eventhub_name                  = "evh-terraform-sql-auditing-australiaeast"
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-terraform-sql-auditing-australiaeast/providers/Microsoft.OperationalInsights/workspaces/log-terraform-sql-auditing-australiaeast"
      + name                           = "diagnostic_setting"
      + target_resource_id             = "/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-terraform-sql-auditing-australiaeast/providers/Microsoft.Sql/servers/sql-terraform-sql-auditing-australiaeast/databases/master"

      + enabled_log {
          + category       = "SQLSecurityAuditEvents"
            # (1 unchanged attribute hidden)
        }
    }

  # azurerm_mssql_server_extended_auditing_policy.auditing will be updated in-place
  ~ resource "azurerm_mssql_server_extended_auditing_policy" "auditing" {
        id                                      = "/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-terraform-sql-auditing-australiaeast/providers/Microsoft.Sql/servers/sql-terraform-sql-auditing-australiaeast/extendedAuditingSettings/default"
      - storage_account_subscription_id         = (sensitive value) -> null
        # (9 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 12 estimated
           $0.0/mo +$0.0

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @flcdrg, Action: `pull_request`*